app/controllers/backoffice/account_configs_controller.rb

    def update
      account_logo = params.dig(:account_config, :account, :logo)
      current_account.logo.attach(account_logo) if account_logo.present?
      if @account_config.update(account_config_params)
---
SELECT "account_configs".* FROM "account_configs" WHERE "account_configs"."account_id" = 2 LIMIT 1
UPDATE "account_configs" SET "updated_at" = '2026-01-20 19:53:24.043696', "enabled_sizes" = '{1,2,3,4,6,8,10,12,14,16,P,M,G,GG,EG,EGG,G1,G2,G3}', "enabled_colors" = '{Branco,Preto,Cinza,Bege,Marrom,Caramelo,Vermelho,Rosa,"Rosa Bebê",Coral,Salmão,Azul,"Azul Marinho","Azul Bebê","Azul Claro","Azul Turquesa",Verde,"Verde Limão","Verde Menta","Verde Oliva",Amarelo,"Amarelo Ouro","Amarelo Limão",Laranja,"Laranja Queimado",Roxo,Lilás,Lavanda,Violeta,Dourado,Prata,Bronze,Estampado,Listrado,Floral,Bolinhas,Xadrez,Nude,Pérola,Creme,Off-White,Champagne}' WHERE "account_configs"."id" = 1