app/controllers/backoffice/dashboard_controller.rb

SELECT COUNT(*) FROM "sales" WHERE "sales"."account_id" = 1 AND "sales"."status" = 'paid' AND (created_at >= '2026-01-20 00:00:00')
SELECT SUM("sales"."total_amount") FROM "sales" WHERE "sales"."account_id" = 1 AND "sales"."status" = 'paid' AND (created_at >= '2026-01-20 00:00:00')
---
    def index
      @account = current_account
      @today_sales = current_account.sales
                                    .where(status: 'paid')
                                    .where('created_at >= ?', Date.current.beginning_of_day)
      @today_total = @today_sales.sum(:total_amount)
      @today_count = @today_sales.count