app/controllers/backoffice/products_controller.rb

    def create
      # Definir current_user para os callbacks
      Product.set_current_user(current_user)

      @product = current_account.products.build(product_params)

      if @product.save
---
INSERT INTO "products" ("account_id", "name", "description", "sku", "supplier_code", "base_price", "cost_price", "category", "brand", "color", "material", "active", "position", "custom_fields", "deleted_at", "created_at", "updated_at", "discarded_at", "size", "stock_quantity") VALUES (2, 'Teste', NULL, NULL, NULL, 12.0, NULL, NULL, NULL, '', NULL, TRUE, NULL, '{}', NULL, '2026-01-21 18:08:07.201127', '2026-01-21 18:08:07.201127', NULL, 'M', 2) RETURNING "id"

    def update
      # Definir current_user para os callbacks
      Product.set_current_user(current_user)

      if @product.update(product_params)
---
UPDATE "products" SET "updated_at" = '2026-01-21 12:24:20.792430' WHERE "products"."id" = 18