app/controllers/backoffice/products_controller.rb

SELECT "account_configs".* FROM "account_configs" WHERE "account_configs"."account_id" = 2 LIMIT 1
---
    def update_view_mode
      @account_config = current_account.account_config || current_account.create_account_config!
      view_mode = params[:view_mode]

      if AccountConfig::PRODUCTS_VIEW_MODES.include?(view_mode)