app/controllers/backoffice/products/stock_adjustments_controller.rb

UPDATE "products" SET "updated_at" = '2026-01-21 18:39:07.426495', "stock_quantity" = 0 WHERE "products"."id" = 19
---
      def update
        # Definir current_user para os callbacks
        Product.set_current_user(current_user)

        old_stock = @product.stock_quantity

        if @product.update(stock_adjustment_params)