app/models/product.rb

  def create_stock_movement_on_change
    return unless current_user.present?

    quantity_before = saved_change_to_stock_quantity[0]
    quantity_after = saved_change_to_stock_quantity[1]
    quantity_change = quantity_after - quantity_before

    return if quantity_change.zero?

    StockMovement.create!(
      product: self,
      account: account,
      user: current_user,
      movement_type: quantity_change.positive? ? :adjustment_in : :adjustment_out,
      quantity_change: quantity_change.abs,
      quantity_before: quantity_before,
      quantity_after: quantity_after,
      observations: "Ajuste de estoque"
    )
---
INSERT INTO "stock_movements" ("account_id", "user_id", "movement_type", "quantity_change", "quantity_before", "quantity_after", "observations", "metadata", "created_at", "updated_at", "product_id") VALUES (2, 1, 'adjustment_out', 2, 2, 0, 'Ajuste de estoque', '{}', '2026-01-21 18:39:07.442112', '2026-01-21 18:39:07.442112', 19) RETURNING "id"