app/controllers/concerns/authentication.rb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def current_user
    @current_user ||= User.find_by(id: session[:user_id]) if session[:user_id]